First/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

First/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

First/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

First/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41. </code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>50. </code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62. </code>
    </items>
    <items>
      <name>РасчетыСПресоналом</name>
      <description>Расчеты с пресоналом</description>
      <code>70. </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90. </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Расходы</name>
        <description>Расходы</description>
        <code>90.2</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

First/src/Documents/РеализацияТоваровИУслуг/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма = ТоварыИУслуги.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
		
	Движения.ВзаиморасчетыСКонтрагентами.Очистить();
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.Товары.Очистить();
	Движения.Товары.Записывать = Истина;
	Движения.Доходы.Очистить();
	Движения.Доходы.Записывать = Истина;
	Движения.Расходы.Очистить();
	Движения.Расходы.Записывать = Истина;      
	
	Движения.Управленческий.Очистить();
	Движения.Управленческий.Записывать = Истина;
	
	ДвижениеКонтрагенты = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	ДвижениеКонтрагенты.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеКонтрагенты.Период = Дата;
	ДвижениеКонтрагенты.Контрагент = Покупатель;
	ДвижениеКонтрагенты.Сумма = Сумма;
	
	Движения.ВзаиморасчетыСКонтрагентами.Записать();

		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Количество КАК Количество,
	               |	РеализацияТоваровИУслугТоварыИУслуги.Сумма КАК Сумма,
	               |	ТоварыОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ТоварыОстатки.Номенклатура.Тип КАК Тип
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоваровИУслугТоварыИУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки КАК ТоварыОстатки
	               |			ПО (ТоварыОстатки.Номенклатура = НоменклатураСправочник.Ссылка)
	               |		ПО РеализацияТоваровИУслугТоварыИУслуги.Номенклатура = НоменклатураСправочник.Ссылка
	               |ГДЕ
	               |	РеализацияТоваровИУслугТоварыИУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Тип = Перечисления.ТипНоменклатуры.Товар Тогда

			Если Выборка.КоличествоОстаток = 0 ИЛИ НЕ ЗначениеЗаполнено(Выборка.КоличествоОстаток) Тогда
				Отказ = Истина;
				Сообщить(СтрШаблон("Товара %1 нет на складе", Выборка.Номенклатура));
				Продолжить;
			ИначеЕсли Выборка.КоличествоОстаток < Выборка.Количество Тогда
				Отказ = Истина;
				Сообщить(СтрШаблон("Товара %1 не хватает", Выборка.Номенклатура));
				Продолжить; 
			КонецЕсли;
			
			Если Выборка.КоличествоОстаток = Выборка.Количество Тогда
				Себестоимость = Выборка.Сумма;
			Иначе
				СредняяЦена = Выборка.СуммаОстаток/Выборка.КоличествоОстаток;
				Себестоимость = СредняяЦена * Выборка.КоличествоОстаток;
			КонецЕсли;   
			
			ДвижениеТовар = Движения.Товары.Добавить();
			ДвижениеТовар.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеТовар.Период = Дата;
			ДвижениеТовар.Номенклатура = Выборка.Номенклатура;
			ДвижениеТовар.Сумма = Себестоимость;
			ДвижениеТовар.Количество = Выборка.Количество;
			
			ДвижениеРасход = Движения.Расходы.Добавить(); 
			ДвижениеРасход.Период = Дата;
			ДвижениеРасход.Номенклатура = Выборка.Номенклатура; 
			ДвижениеРасход.Сумма = Себестоимость;
			
			Движение = Движения.Управленческий.Добавить();
			Движение.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
			Движение.Период = Дата;
			Движение.Сумма = Себестоимость;

		КонецЕсли; 
		
		ДвижениеДоход = Движения.Доходы.Добавить();
		ДвижениеДоход.Период = Дата;
		ДвижениеДоход.Номенклатура = Выборка.Номенклатура;
		ДвижениеДоход.Количество = Выборка.Количество;
		ДвижениеДоход.Сумма = Выборка.Сумма; 
		
				
		Движения.Товары.Записать();
		Движения.Расходы.Записать();
		Движения.Доходы.Записать();
		Движения.Управленческий.Записать();
		
	КонецЦикла;
		
	//Бухгалтерское формирование движения и проводки
	ДвижениеУпр = Движения.Управленческий.Добавить();
	ДвижениеУпр.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	ДвижениеУпр.СчетКт = ПланыСчетов.Управленческий.Выручка;
	ДвижениеУпр.Период = Дата;
	ДвижениеУпр.Сумма = Сумма;

	
	Движения.Управленческий.Записать();
	

	
	
	
КонецПроцедуры
